---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Path3d
source: html/d31d704d-d8bd-514c-46e7-ba0c06a7500a.htm
---
# Path3d Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.